Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: General-header field names can be extended reliably only in combination with a change in the protocol version.
zh_cn: 只有在协议版本发生变化的情况下，才能可靠地扩展通用首部字段名称。

source: Generally, `generate` uses 3 callbacks.
zh_cn: 通常，`generate` 使用 3 个回调。

source: Generally, many operators gained overloads that now allow specifying the internal buffer size or prefetch amount they should run their upstream (or inner sources).
zh_cn: 通常，许多操作符获得了重载，现在允许指定内部缓冲区大小或它们应该运行其上游(或内部源)的预取量。

source: Generate a string R of 46 random bytes
zh_cn: 生成一个 46 个随机字节的字符串 R.

source: Generate a string R of 48 random bytes
zh_cn: 生成一个 48 个随机字节的字符串 R

source: Generic Syntax
zh_cn: 通用语法

source: Given an asynchronous source, fluent blocking for a terminal event is now possible:
zh_cn: 给定异步源，现在可以对终端事件进行流畅阻塞：

source: Given the overflowing example in the introduction, we can just increase the buffer size of `observeOn` to have enough room for all values.
zh_cn: 鉴于介绍中的溢出示例，我们可以增加 `observeOn` 的缓冲区大小，以便为所有值提供足够的空间。

source: Given this, the sending party cannot, in general, know how the receiving party will behave.
zh_cn: 鉴于此，发送方通常不能知道接收方的行为方式。

source: Go on with your business; whenever the call returns, the observer’s method will begin to operate on its return value or values — the items emitted by the Observable.
zh_cn: 继续你的业务；每当调用返回时，观察者的方法将开始对其返回值或返回值值 - Observable 发射的 items (数据项) 进行操作。

source: Goals
zh_cn: 目标

source: Goals of This Document
zh_cn: 本文档的目标

source: HMAC [RFC2104] uses the Hash algorithm for the handshake.
zh_cn: HMAC [RFC2104] 使用哈希算法进行握手。

source: HMAC and the Pseudorandom Function
zh_cn: HMAC 和伪随机函数

source: HT = <US-ASCII HT, horizontal-tab (9)>
zh_cn: HT = <US-ASCII HT, 水平制表符 (9)>

source: HTTP Message
zh_cn: HTTP 消息

source: HTTP Version
zh_cn: HTTP 版本

source: HTTP [RFC2616] was originally used in the clear on the Internet.
zh_cn: HTTP [RFC2616] 最初没有危险的(in the clear)用于互联网上。

source: HTTP allows an open-ended set of methods and headers that indicate the purpose of a request [47].
zh_cn: HTTP 允许一组开放式的方法和首部来指示请求的目的 [47]。

source: HTTP applications MUST accept CRLF, bare CR, and bare LF as being representative of a line break in text media received via HTTP.
zh_cn: HTTP 应用程序必须接受 CRLF，单独 CR 和单独 LF，以表示通过 HTTP 接收的文本媒体中的换行符。

source: HTTP applications are not required to understand the meaning of all registered status codes, though such understanding is obviously desirable.
zh_cn: HTTP 应用程序不需要理解所有已注册状态代码的含义，尽管这种理解显然是可取的。

source: HTTP applications have historically allowed three different formats for the representation of date/time stamps:
zh_cn: 历史上，HTTP 应用程序允许使用三种不同的格式来表示日期/时间戳：

source: HTTP character sets are identified by case-insensitive tokens.
zh_cn: HTTP 字符集由不区分大小写的标记标识。

source: HTTP clients are not required to understand the meaning of all registered status codes, though such understanding is obviously desirable.
zh_cn: HTTP 客户端不需要理解所有已注册状态代码的含义，尽管这种理解显然是可取的。

source: HTTP communication is initiated by a user agent for some purpose.
zh_cn: 出于某种目的，HTTP 通信由用户代理启动。

source: HTTP communication usually takes place over TCP/IP connections.
zh_cn: HTTP 通信通常通过 TCP/IP 连接进行。

source: HTTP content negotiation (section 12) uses short "floating point" numbers to indicate the relative importance ("weight") of various negotiable parameters.
zh_cn: HTTP 内容协商(第 12 节)使用短“浮点”数字来指示各种可协商参数的相对重要性(“权重”)。

source: HTTP does not define specific error handling mechanisms except when they have a direct impact on security, since different applications of the protocol require different error handling strategies.
zh_cn: HTTP 没有定义特定的错误处理机制，除非它们对安全性有直接影响，因为协议的不同应用程序需要不同的错误处理策略。

source: HTTP does not have specific length limitations for many of its protocol elements because the lengths that might be appropriate will vary widely, depending on the deployment context and purpose of the implementation.
zh_cn: HTTP 对其许多协议元素没有特定的长度限制，因为可能适当的长度会有很大差异，具体取决于部署上下文和实现的目的。

source: HTTP does not include a request identifier for associating a given request message with its corresponding one or more response messages.
zh_cn: HTTP 不包括用于将给定请求消息与其对应的一个或多个响应消息相关联的请求标识符。

source: HTTP does not limit the nature of a resource; it merely defines an interface that might be used to interact with resources.
zh_cn: HTTP 不限制资源的性质；它只定义了一个可能用于与资源交互的接口。

source: HTTP does not place a predefined limit on the length of a request-line, as described in Section 2.5.
zh_cn: HTTP 不会对请求行的长度设置预定义的限制，如第 2.5 节所述。

source: HTTP does not place a predefined limit on the length of each header field or on the length of the header section as a whole, as described in Section 2.5.
zh_cn: HTTP 没有对每个首部字段的长度或整个首部的长度设置预定义的限制，如第 2.5 节所述。

source: HTTP enables the use of intermediaries to satisfy requests through a chain of connections.
zh_cn: HTTP 允许使用中介通过一系列连接来满足请求。

source: HTTP has been in use by the World-Wide Web global information initiative since 1990.
zh_cn: 自 1990 年以来，万维网全球信息倡议一直在使用 HTTP。

source: HTTP header fields, which include general-header (section 4.5), request-header (section 5.3), response-header (section 6.2), and entity-header (section 7.1) fields, follow the same generic format as that given in Section 3.1 of RFC 822 [9].
zh_cn: HTTP 首部字段，包括通用首部(第 4.5 节)，请求首部(第 5.3 节)，响应首部(第 6.2 节)和实体首部(第 7.1 节)字段，遵循与 RFC 822 [9] 的 3.1 节中给出的相同的通用格式。

source: HTTP implementations SHOULD implement persistent connections.
zh_cn: HTTP 实现应该实现持久连接。

source: HTTP implementations SHOULD support persistent connections.
zh_cn: HTTP 实现应该支持持久连接。

source: HTTP implementations are expected to engage in connection management, which includes maintaining the state of current connections, establishing a new connection or reusing an existing connection, processing messages received on a connection, detecting connection failures, and closing each connection.
zh_cn: HTTP 实现预计将参与连接管理，包括维护当前连接的状态，建立新连接或重用现有连接，处理连接上接收的消息，检测连接失败以及关闭每个连接。

source: HTTP is a generic interface protocol for information systems.
zh_cn: HTTP 是信息系统的通用接口协议。

source: HTTP is a stateless request/response protocol that operates by exchanging messages (Section 3) across a reliable transport- or session-layer "connection" (Section 6).
zh_cn: HTTP 是一种无状态请求/响应协议，通过在可靠的传输层或会话层“连接”(第 6 节)之间交换消息(第 3 节)来运行。

source: HTTP is also designed for use as an intermediation protocol for translating communication to and from non-HTTP information systems.
zh_cn: HTTP 还被设计用作中介协议，用于转换与非 HTTP 信息系统之间的通信。

source: HTTP is also used as a generic protocol for communication between user agents and proxies/gateways to other Internet systems, including those supported by the SMTP [16], NNTP [13], FTP [18], Gopher [2], and WAIS [10] protocols.
zh_cn: HTTP 还用作用户代理和代理/网关与其他 Internet 系统之间通信的通用协议，包括 SMTP [16]，NNTP [13]，FTP [18]，Gopher [2] 和 WAIS [ 10] 协议。

source: HTTP is defined as a stateless protocol, meaning that each request message can be understood in isolation.
zh_cn: HTTP 被定义为无状态协议，这意味着可以孤立地理解每个请求消息。

source: HTTP is used in a wide variety of applications, ranging from general-purpose computers to home appliances.
zh_cn: HTTP 用于各种应用程序，从通用计算机到家用电器。

source: HTTP messages can be (and often are) buffered by implementations; despite it sometimes being available as a stream, HTTP is fundamentally a message-oriented protocol.
zh_cn: HTTP 消息可以(通常是)由实现缓冲；尽管它有时可用作流，但 HTTP 基本上是面向消息的协议。

source: HTTP messages consist of requests from client to server and responses from server to client.
zh_cn: HTTP 消息包括从客户端到服务器的请求以及从服务器到客户端的响应。

source: HTTP messaging is independent of the underlying transport- or session-layer connection protocol(s).
zh_cn: HTTP 消息传递独立于底层传输层或会话层连接协议。

source: HTTP only presumes a reliable transport with in-order delivery of requests and the corresponding in-order delivery of responses.
zh_cn: HTTP 仅假定可靠的传输，具有按顺序递送请求和相应的有序响应传递。

source: HTTP only presumes a reliable transport; any protocol that provides such guarantees can be used; the mapping of the HTTP/1.1 request and response structures onto the transport data units of the protocol in question is outside the scope of this specification.
zh_cn: HTTP 只假定可靠的传输；可以使用任何提供此类保证的协议；HTTP/1.1 请求和响应结构到所讨论协议的传输数据单元的映射超出了本规范的范围。

source: HTTP provides a uniform interface for interacting with a resource (Section 2), regardless of its type, nature, or implementation, via the manipulation and transfer of representations (Section 3).
zh_cn: HTTP 提供了一个统一的接口，用于与资源交互(第 2 节)，无论其类型，性质或实现，通过表示的操作和传输(第 3 节)。

source: HTTP proxies and gateways can provide access to alternative information services by translating their diverse protocols into a hypertext format that can be viewed and manipulated by clients in the same way as HTTP services.
zh_cn: HTTP 代理和网关可以通过将其不同的协议转换为超文本格式来提供对替代信息服务的访问，该超文本格式可以由客户端以与 HTTP 服务相同的方式查看和操纵。

source: HTTP relaxes this requirement and allows the transport of text media with plain CR or LF alone representing a line break when it is done consistently for an entire entity-body.
zh_cn: HTTP 放宽了这一要求，并允许传输具有普通 CR 或 LF 表示换行符的文本媒体，当在整个实体主体一致时。

source: HTTP relies upon the Uniform Resource Identifier (URI) standard [RFC3986] to indicate the target resource (Section 5.1) and relationships between resources.
zh_cn: HTTP 依赖于统一资源标识符(URI)标准 [RFC3986] 来指示目标资源(第 5.1 节)和资源之间的关系。

source: HTTP request message routing is determined by each client based on the target resource, the client's proxy configuration, and establishment or reuse of an inbound connection.
zh_cn: HTTP 请求消息路由由每个客户端基于目标资源，客户端的代理配置以及入站连接的建立或重用来确定。

source: HTTP requirements for cache behavior and cacheable responses are defined in Section 2 of [RFC7234].
zh_cn: 缓存行为和可缓存响应的 HTTP 要求在 [RFC7234] 的第 2 节中定义。

source: HTTP requirements for cache behavior and cacheable responses are defined in section 13.
zh_cn: 缓存行为和可缓存响应的 HTTP 要求在第 13 节中定义。

source: HTTP requirements regarding connection management are defined in Section 6.
zh_cn: 有关连接管理的 HTTP 要求在第 6 节中定义。

source: HTTP semantics include the intentions defined by each request method (Section 4), extensions to those semantics that might be described in request header fields (Section 5), the meaning of status codes to indicate a machine-readable response (Section 6), and the meaning of other control data and resource metadata that might be given in response header fields (Section 7).
zh_cn: HTTP 语义包括每个请求方法定义的意图(第 4 节)，可能在请求首部字段(第 5 节)中描述的那些语义的扩展，用于指示机器可读响应的状态代码的含义(第 6 节)，以及可能在响应首部字段中给出的其他控制数据和资源元数据的含义(第 7 节)。

source: HTTP status codes are extensible.
zh_cn: HTTP 状态代码是可扩展的。

source: HTTP systems are used in corporate intranets over high-bandwidth links, and for access via PDAs with low-power radio links and intermittent connectivity.
zh_cn: HTTP 系统通过高带宽链路在企业内部网中使用，并通过具有低功率无线电链路和间歇性连接的 PDA 进行访问。

source: HTTP uses Internet Media Types [17] in the Content-Type (section 14.17) and Accept (section 14.1) header fields in order to provide open and extensible data typing and type negotiation.
zh_cn: HTTP 在 Content-Type(第 14.17 节)和 Accept(第 14.1 节)首部字段中使用互联网媒体类型 [17]，以提供开放和可扩展的数据类型和类型协商。

source: HTTP uses a "<major>.<minor>" numbering scheme to indicate versions of the protocol.
zh_cn: HTTP 使用“<major>.<minor>”编号方案来指示协议的版本。

source: HTTP uses language tags within the Accept-Language and Content-Language fields.
zh_cn: HTTP 使用 Accept-Language 和 Content-Language 字段中的语言标记。

source: HTTP uses the same definition of the term "character set" as that described for MIME:
zh_cn: HTTP 使用与 MIME 描述的术语“字符集”相同的定义：

source: HTTP was created for the World Wide Web (WWW) architecture and has evolved over time to support the scalability needs of a worldwide hypertext system.
zh_cn: HTTP 是为万维网(WWW)架构创建的，并且随着时间的推移不断发展以支持全球超文本系统的可扩展性需求。

source: HTTP was originally designed to be usable as an interface to distributed object systems.
zh_cn: HTTP 最初设计为可用作分布式对象系统的接口。

source: HTTP's approach to error handling has been explained.
zh_cn: 已经解释了 HTTP 的错误处理方法。

source: HTTP-date is case sensitive and MUST NOT include additional LWS beyond that specifically included as SP in the grammar.
zh_cn: HTTP-date 区分大小写，并且不得包含超出语法中特定包含的 SP 的额外的 LWS。

source: HTTP-version is case-sensitive.
zh_cn: HTTP 版本区分大小写。

source: HTTP/1.0, as defined by RFC 1945 [6], improved the protocol by allowing messages to be in the format of MIME-like messages, containing metainformation about the data transferred and modifiers on the request/response semantics.
zh_cn: RFC 1945 [6] 定义的 HTTP/1.0 通过允许消息采用类似 MIME 的消息格式改进了协议，包含有关传输数据的元信息和请求/响应语义的修饰符。

source: HTTP/1.1 allows a client to request that only part (a range of) the response entity be included within the response.
zh_cn: HTTP/1.1 允许客户端请求响应实体中仅包含部分(一系列)响应实体。

source: HTTP/1.1 applications MUST NOT generate more than three digits after the decimal point.
zh_cn: HTTP/1.1 应用程序在小数点后不得生成超过三位数。

source: HTTP/1.1 clients and servers that parse the date value MUST accept all three formats (for compatibility with HTTP/1.0), though they MUST only generate the RFC 1123 format for representing HTTP-date values in header fields.
zh_cn: 解析日期值的 HTTP/1.1 客户端和服务器必须接受所有三种格式(为了与 HTTP/1.0 兼容)，但它们必须只生成 RFC 1123 格式以在头字段中表示 HTTP 日期值。

source: HTTP/1.1 defaults to the use of "persistent connections", allowing multiple requests and responses to be carried over a single connection.
zh_cn: HTTP/1.1 默认使用“持久连接”，允许通过单个连接传输多个请求和响应。

source: HTTP/1.1 defines the sequence CR LF as the end-of-line marker for all protocol elements except the entity-body (see appendix 19.3 for tolerant applications).
zh_cn: HTTP/1.1 将序列 CR LF 定义为除实体主体之外的所有协议元素的行尾标记(有关 tolerant 应用程序，请参见附录 19.3)。

source: HTTP/1.1 does not define how a PUT method affects the state of an origin server.
zh_cn: HTTP/1.1 没有定义 PUT 方法如何影响原始服务器的状态。

source: HTTP/1.1 has been designed to allow implementations of applications that do not depend on knowledge of ranges.
zh_cn: HTTP/1.1 旨在允许不依赖于范围知识的应用程序的实现。

source: HTTP/1.1 header field values can be folded onto multiple lines if the continuation line begins with a space or horizontal tab.
zh_cn: 如果连续行以空格或水平制表符开头，则 HTTP/1.1 首部字段值可以折叠到多行上。

source: HTTP/1.1 implementations MAY ignore ranges specified using other units.
zh_cn: HTTP/1.1 实现可以忽略使用其他单元指定的范围。

source: HTTP/1.1 recipients MUST respect the charset label provided by the sender; and those user agents that have a provision to "guess" a charset MUST use the charset from the content-type field if they support that charset, rather than the recipient's preference, when initially displaying a document.
zh_cn: HTTP/1.1 收件人必须尊重提供的字符集标签；那些有“猜测”字符集的用户代理必须使用内容类型字段中的字符集而不是收件人的首选项，如果它们在最初显示文档时支持该字符集。

source: HTTP/1.1 servers SHOULD maintain persistent connections and use TCP's flow control mechanisms to resolve temporary overloads, rather than terminating connections with the expectation that clients will retry.
zh_cn: HTTP/1.1 服务器应该保持持久连接并使用 TCP 的流控制机制来解决临时过载，而不是终止连接，期望客户端重试。

source: HTTP/1.1 user agents MUST notify the user when an invalid length is received and detected.
zh_cn: HTTP/1.1 用户代理必须在收到并检测到无效长度时通知用户。

source: HTTP/1.1 uses content-coding values in the Accept-Encoding (section 14.3) and Content-Encoding (section 14.11) header fields.
zh_cn: HTTP/1.1 使用 Accept-Encoding(第 14.3 节)和 Content-Encoding(第 14.11 节)头部字段中的内容编码值。

source: HTTP/1.1 uses entity tags in the ETag (section 14.19), If-Match (section 14.24), If-None-Match (section 14.26), and If-Range (section 14.27) header fields.
zh_cn: HTTP/1.1 使用 ETag(第 14.19 节)，If-Match(第 14.24 节)，If-None-Match(第 14.26 节)和 If-Range(第 14.27 节)首部字段中的实体标签。

source: HTTP/1.1 uses range units in the Range (section 14.35) and Content-Range (section 14.16) header fields.
zh_cn: HTTP/1.1 使用 Range (第 14.35 节)和 Content-Range (第 14.16 节)首部字段中的范围单位。

source: HTTP/1.1 uses transfer-coding values in the TE header field (section 14.39) and in the Transfer-Encoding header field (section 14.41).
zh_cn: HTTP/1.1 使用 TE 首部字段(第 14.39 节)和 Transfer-Encoding 首部字段(第 14.41 节)中的传输编码值。

source: HTTP/TLS is differentiated from HTTP URIs by using the 'https' protocol identifier in place of the 'http' protocol identifier.
zh_cn: 通过使用“https”协议标识符代替“http”协议标识符，来区别 HTTP/TLS 与 HTTP URI 的不同。

source: Half-Open Connection Discovery
zh_cn: 半开连接发现

source: Half-Open Connections and Other Anomalies
zh_cn: 半开连接和其他异常

source: Handling Incomplete Messages
zh_cn: 处理不完整的消息

source: Handshake Protocol
zh_cn: 握手协议

source: Handshake Protocol Overview
zh_cn: 握手协议概述

source: Handshake messages MAY be coalesced into a single TLSPlaintext record or fragmented across several records, provided that:
zh_cn: 握手消息可以合并为单个 TLSPlaintext 记录，也可以分散在多个记录中，前提是：

source: Handshake messages are supplied to the TLS record layer, where they are encapsulated within one or more TLSPlaintext or TLSCiphertext structures which are processed and transmitted as specified by the current active connection state.
zh_cn: 握手消息被提供给 TLS 记录层，其中它们被封装在一个或多个 TLSPlaintext 或 TLSCiphertext 结构中，这些结构按照当前活动连接状态的指定进行处理和发送。

source: Handshake messages are supplied to the TLS record layer, where they are encapsulated within one or more TLSPlaintext structures, which are processed and transmitted as specified by the current active session state.
zh_cn: 握手消息被提供给 TLS 记录层，它们被封装在一个或多个 TLSPlaintext 结构中，这些结构按照当前活动会话状态的指定进行处理和传输。

source: Hash denotes a Hash of the handshake messages.
zh_cn: Hash 表示握手消息的散列。

source: Hash.length is its output length in bytes.
zh_cn: Hash.length 是其输出长度(以字节为单位)。

source: Having identified a resource, a system may perform a variety of operations on the resource, as might be characterized by such words as `access', `update', `replace', or `find attributes'.
zh_cn: 在识别出资源之后，系统可以对资源执行各种操作，其特征可以是诸如“访问”，“更新”，“替换”或“查找属性”之类的单词。

source: Header Field Definitions
zh_cn: 首部字段定义

source: Header Field Registration
zh_cn: 首部字段注册

source: Header Field Registry
zh_cn: 首部字段注册

source: Header Fields
zh_cn: 首部字段

source: Header Format
zh_cn: 首部格式

source: Header field extensibility is discussed in Section 3.2.1.
zh_cn: 首部字段可扩展性在第 3.2.1 节中讨论。

source: Header fields are fully extensible: there is no limit on the introduction of new field names, each presumably defining new semantics, nor on the number of header fields used in a given message.
zh_cn: 首部字段是完全可扩展的：新字段名称的引入没有限制，每个字段名称可能定义新的语义，也不限于给定消息中使用的首部字段的数量。

source: Header fields can be extended over multiple lines by preceding each extra line with at least one SP or HT.
zh_cn: 通过在每个额外的行前面至少有一个 SP 或 HT，可以将首部字段扩展到多行。

source: Header fields that span multiple lines ("line folding") are deprecated.
zh_cn: 不推荐使用跨越多行的首部字段(“行折叠”)。

source: Header fields that specifically describe the payload, rather than the associated representation, are referred to as "payload header fields".
zh_cn: 专门描述有效载荷而不是相关表示的首部字段被称为“有效载荷首部字段”。

source: HelloRequest is a simple notification that the client should begin the negotiation process anew.
zh_cn: HelloRequest 是一个简单的通知，客户端应该重新开始协商过程。

source: Hence, HTTP requirements are placed on senders, recipients, clients, servers, user agents, intermediaries, origin servers, proxies, gateways, or caches, depending on what behavior is being constrained by the requirement.
zh_cn: 因此，HTTP 要求被放置在发送者，接收者，客户端，服务器，用户代理，中介，源服务器，代理，网关或缓存上，具体取决于要求约束的行为。

source: Hence, a server MUST NOT assume that two requests on the same connection are from the same user agent unless the connection is secured and specific to that agent.
zh_cn: 因此，服务器绝不能假设同一连接上的两个请求来自同一个用户代理，除非该连接是安全的并且特定于该代理。

source: Hence, interoperability between senders and recipients depends on shared expectations regarding what is a reasonable length for each protocol element.
zh_cn: 因此，发送者和接收者之间的互操作性取决于对每个协议元素的合理长度的共同期望。

source: Hence, it relies on the order of response arrival to correspond exactly to the order in which requests are made on the same connection.
zh_cn: 因此，它依赖于响应到达的顺序，以完全对应于在同一连接上进行请求的顺序。

source: Hence, the Connection header field provides a declarative way of distinguishing header fields that are only intended for the immediate recipient ("hop-by-hop") from those fields that are intended for all recipients on the chain ("end-to-end"), enabling the message to be self-descriptive and allowing future connection-specific extensions to be deployed without fear that they will be blindly forwarded by older intermediaries.
zh_cn: 因此，Connection 首部字段提供了一种声明性方法，用于区分仅针对直接接收者(“逐跳”)的首部字段，以及针对链上所有接收者的那些字段(“端到端” “)，使消息具有自我描述性，允许部署未来特定于连接的扩展，而不必担心旧的中介会盲目地转发它们。

source: Hence, the solution requires a suitable mechanism for picking an initial sequence number and a slightly involved handshake to exchange the ISN's.
zh_cn: 因此，该解决方案需要合适的机制来挑选初始序列号和稍微涉及的握手以交换 ISN。

source: Hence, when people speak of retrieving some identifiable information via HTTP, they are generally referring to making a GET request.
zh_cn: 因此，当人们谈到通过 HTTP 检索某些可识别信息时，他们通常指的是发出 GET 请求。

source: Here handshake_messages refers to all handshake messages sent or received, starting at client hello and up to, but not including, this message, including the type and length fields of the handshake messages.
zh_cn: 这里 handshake_messages 指发送或接收的所有握手消息，开始于客户端 hello 并直到但不包括此消息，包括握手消息的类型和长度字段。

source: Here the `computeValue` is executed only when a subscriber subscribes and for each of them, printing the expected 1 and 2.
zh_cn: 这里的 `computeValue` 仅在订阅者订阅时执行，并且每个订阅者都打印预期的 1 和 2。

source: Here the `onStart` implementation indicates `range` to produce its first value, which is then received in `onNext`.
zh_cn: 这里 `onStart` 实现指示 `range` 产生它的第一个值，然后在 `onNext` 中接收它。

source: Here, T' occupies n bytes in the data stream, where n is a multiple of the size of T. The length of the vector is not included in the encoded stream.
zh_cn: 这里，T' 占据数据流中的 n 个字节，其中 n 是 T 大小的倍数。vector 的长度不包括在编码流中。

source: Here, `flatMap` works as well:
zh_cn: 这里，`flatMap` 也适用：

source: Here, if we imagine ourselves on `operator2`, looking to the left towards the source, is called the **upstream**.
zh_cn: 在这里，如果我们想象自己在 `operator2`，向左看向源，则称为 **upstream**。

source: Here, the original `value` will be available inside the inner `flatMap`, courtesy of lambda variable capture.
zh_cn: 在这里，原始的 `value` 将在内部 `flatMap` 中可用，由 lambda 变量捕获提供。

source: Here:
zh_cn: 这里：

source: Heuristic Expiration
zh_cn: 启发式过期

source: Hexadecimal numeric characters are used in several protocol elements.
zh_cn: 十六进制数字字符用于多个协议元素。

source: Hierarchical Identifiers
zh_cn: 分层标识符

source: Higher-level protocols can layer on top of the TLS protocol transparently.
zh_cn: 更高级别的协议可以透明地层叠在 TLS 协议之上。

source: Historically, HTTP has allowed field content with text in the ISO-8859-1 charset [ISO-8859-1], supporting other charsets only through use of [RFC2047] encoding.
zh_cn: 在历史上，HTTP 允许字段内容使用在 ISO-8859-1 字符集 [ISO-8859-1] 中的文本，仅通过使用 [RFC2047] 编码支持其他字符集。

source: Historically, HTTP header field values could be extended over multiple lines by preceding each extra line with at least one space or horizontal tab (obs-fold).
zh_cn: 历史上，HTTP 首部字段值可以通过在每个额外行之前用至少一个空格或水平制表符(obs-fold)在多行上扩展。

source: History Lists
zh_cn: 历史名单

source: Hosts which prefer to avoid waiting are willing to risk possible confusion of old and new packets at a given destination may choose not to wait for the "quite time".
zh_cn: 希望避免等待的主机愿意冒险在给定目的地处可能混淆新旧分组可能选择不等待“相当时间”。

source: How is this Observable implemented?
zh_cn: Observable 是如何实现的？

source: How that identification is accomplished, assigned, or enabled is delegated to each scheme specification.
zh_cn: 如何完成，分配或启用该标识将委托给每个方案规范。

source: How that is accomplished is dependent on the target URI scheme and defined by its associated specification, similar to how this specification defines origin server access for resolution of the "http" (Section 2.7.1) and "https" (Section 2.7.2) schemes.
zh_cn: 如何实现取决于目标 URI 方案并由其相关规范定义，类似于此规范如何定义原始服务器访问以解析“http”(第 2.7.1 节)和“https”(第 2.7.2 节)方案。

source: However, 0-RTT parameters are those negotiated in the previous handshake; mismatches may require rejecting 0-RTT (see Section 4.2.10).
zh_cn: 但是，0-RTT 参数是先前握手中协商的参数；不匹配可能需要拒绝 0-RTT(参见第 4.2.10 节)。

source: However, Android is more strict and terminates the application in such uncaught exception cases.
zh_cn: 但是，Android 更严格，并在此类未捕获的异常情况下终止应用程序。
